from playwright.sync_api import expect

from module.BasePage import 使用new_context登录并返回实例化的page
from testcases import *
from utils.GetPath import get_path

@用例名称("测试场所信息的列表数据权限功能")
@用例描述("""
1.登录某角色账号，并跳转到场所信息页面
2.查看表格中所属组织这一列，断言其全部等于“中电数智街道”
""")
def test_验证列表数据权限(new_context):
    列表_字典 = [
        {"用户名":"三级网格员", "能查到的商铺名称":["测试商铺111"], "查不到的商铺名称":["测试数据格式"]},
        {"用户名":"二级网格员", "能查到的商铺名称":["测试商铺111","测试数据格式", "批量导入", "宝来超市"], "查不到的商铺名称":["中电数智社区（演示）下的商铺"]},
        {"用户名": "社区管理员-中电数智社区", "能查到的商铺名称": ["测试商铺111","测试数据格式", "批量导入", "宝来超市"], "查不到的商铺名称": [""]},
        {"用户名": "一级网格员", "能查到的商铺名称": ["测试商铺111","测试数据格式", "批量导入", "宝来超市", "中电数智社区（演示）下的商铺"], "查不到的商铺名称": []},
        {"用户名": "街道管理员-中电数智街道", "能查到的商铺名称": ["测试商铺111","测试数据格式", "批量导入", "宝来超市", "中电数智社区（演示）下的商铺"], "查不到的商铺名称": []},
        # {"用户名":"区县级管理员-庐阳区", "能查到的商铺名称":[], "查不到的商铺名称":[]},
        # {"用户名":"市级管理员-合肥市", "能查到的商铺名称":[], "查不到的商铺名称":[]},
        # {"用户名":"省级管理员-安徽省", "能查到的商铺名称":[], "查不到的商铺名称":[]},
    ]
    for 字典 in 列表_字典:
        my_page_用户 = 使用new_context登录并返回实例化的page(new_context, 字典["用户名"])
        with 测试步骤("跳转到类型管理页面"):
            my_page_用户.场所信息.navigate()
            for 值 in 字典["能查到的商铺名称"]:
                my_page_用户.场所信息.输入查询条件(商铺名称=值)
                my_page_用户.场所信息.click_button("搜索")
                my_page_用户.场所信息.table.等待表格加载完成()
                expect(my_page_用户.page.get_by_text("暂无数据")).not_to_be_visible()
            for 值 in 字典["查不到的商铺名称"]:
                my_page_用户.场所信息.输入查询条件(商铺名称=值)
                my_page_用户.场所信息.click_button("搜索")
                my_page_用户.场所信息.table.等待表格加载完成()
                expect(my_page_用户.page.get_by_text("暂无数据")).to_be_visible()
        my_page_用户.page.close()
    # my_page_用户.场所信息.page.wait_for_timeout(20000000)